RSS/2021-03-05-Zoom-screen-sharing.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://jeslie0.github.io/rss.xml"
      title="RSS feed for https://jeslie0.github.io">
<title>iPad Screen Sharing to Zoom on a University Network</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">05 Mar 2021</div><h1 class="post-title"><a href="https://jeslie0.github.io/2021-03-05-Zoom-screen-sharing.html">iPad Screen Sharing to Zoom on a University Network</a></h1>
<p>
I am currently a teaching assistant for a first year linear algebra course. We recently made the switch to a hybrid setup, meaning that I am streaming the tutorials on Zoom as well as talking to a class in-person. Instead of writing on the physical whiteboards in the classroom, I instead write on my iPad and share the screen through Zoom. Previously, when the tutorials were just based on Zoom, this setup worked pretty well - I can share my screen over Zoom using my home WiFi network. However, I can't screen share over the university network due to the way it is set up.
</p>

<div id="outline-container-org9e4a386" class="outline-2">
<h2 id="org9e4a386">Solution 1</h2>
<div class="outline-text-2" id="text-org9e4a386">
<p>
The basic solution is to log into the Zoom call on the iPad, and share the screen through the Zoom app. This is less than ideal, however; as it means that if you haven't turned off notifications, they can be displayed to the class. Also, I use the app GoodNotes to write my solutions on. The app is good, but there is a large header of different pen options that takes up too much space for my liking. This header is not shown when sharing content to Zoom over the network, rather than through the IPad.
</p>
</div>
</div>

<div id="outline-container-orgc160198" class="outline-2">
<h2 id="orgc160198">Solution 2</h2>
<div class="outline-text-2" id="text-orgc160198">
<p>
The current solution I use works on Windows 10 laptops. Windows 10 has the functionality to be connected to a network whilst also being a WiFi hotspot. Information on how to enable this can be found <a href="https://support.microsoft.com/en-us/windows/use-your-pc-as-a-mobile-hotspot-c89b0fad-72d5-41e8-f7ea-406ad9036b85">here</a>. Once the hotspot is up and running, we can connect the iPad to the network. Then, Zoom can detect the IPad, and we can share content over this network. So far, this has worked well for me. The only caveat is that it seems like you can't get access to the internet on the IPad whilst connected to the network. This isn't a major problem for me, as I still have access through my laptop.
</p>

<p>
This setup might work for other operating systems, but I am not able to test that theory out.
</p>
</div>
</div>
<div class="taglist"></div></div>
<div id="postamble" class="status"></div>
</body>
</html>
